---
kind: other
id: Methods.T:Autodesk.Revit.DB.Material
zh: 材质、材料
source: html/e2fa4ac8-4892-7fc2-116d-82cf0467fd11.htm
---
# Material Methods

**中文**: 材质、材料

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.